// Generated automatically from جدول_استقبال_الاساتذة_المجمع.xlsx on 2026-08-19 20:51:20
window.DEFAULT_SCHEDULE_DATA = {
  "general_schedule": [
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أحمد عبد السلام عبد الحليم يوسف",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تطور عضوي (Z), لافقاريات 2 (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أمل محمد عليوة عبد الحميد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "وراثة نبات (B), وراثةB"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ايمان زكريا جمعة السيد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "فيروسات+ بكتيريا (B), ميكروبيولوجيا تطبيقية (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ايمان محمد فوزى السيد اسماعيل",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "نبات تقسيمي (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "خلف الله صابر احمد محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علم الحشرات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "رانيا سامى حنفى امين",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "فسيولوجيا النبات 1 (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "رمضان عبد الصادق رمضان مصطفى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أنسجة + تقنية مجهرية (Z), علم الخلية وبيولوجيا جزيئيه (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "زينب محمد إبراهيم سيد الأهل",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "فطريات وبكتيريا وفيروسات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "سامية عجيب أقلاديوس منصور",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "فسيولوجيا نبات (B), فسيولوجيا نبات متقدم (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ساميه محمد ابراهيم صقر",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علم الخلية + بيولوجيا جزيئية (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "سحر أحمد صبري",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أجنة (Z), اجنة (z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "شوكت محمود أحمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "هندسة وراثية + زراعة انسجة نباتية (B), هندسة وراثية+زراعة انسجة نباتية (B), وراثة خلوية وجزيئية(B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "صفيه جابر عبدالله محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علوم الأرض والفضاء"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "عبدالمنعم أحمد محمود محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "بيئات ترسيبيه وسحنات (G), مقدمه فى علوم الفضاء (فلك1) (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "محمد حامد عبد العال حسن",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "جيوفيزياء (G), جيولوجية عامة (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "محمد عبد العزيز فؤاد خضير",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تطبيقات علم الاحياء في الحياة, قراءات فى التخصص باللغة الانجليزية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "محمودفتحى محمود",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "خلية + بيولوجية جزيئية + أجنة (Z), خلية + بيولوجية جزيئية + أجنةZ"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "منال ماهر حسينى أمين",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أسس علم النبات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "نجلاء زكى ابراهيم الألفى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "وراثة حيوان (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "هانى نادى يوسف",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تطبيقات اسس علم الوراثة في الصحة العامة"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "هبه ابراهيم محمد ابراهيم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "فسيولوجيا نبات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "هناء حجازى على إبراهيم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "وراثة خلوية وجزيئية (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "هناء رزق أبوالوفا أحمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أسس علم الحيوان (Z), أنسجة + تقنية مجهرية (Z), انسجة وتقنية مجهرية (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "وليد فتحي محمد ابراهيم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "سلوك حيوان + حيوان اقتصادي (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "چورچ سعد إسحاق فهد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أسس علم النبات (B), فطريات وفسيولوجيا كائنات دقيقة (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أحمد على عبد الخالق عمران",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "ارشجونيات + تطور نبات (B), وراثة نبات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ألفت محمد حسين يوسف",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "حبليات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أميمه محمد مصطفي عبدالله",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "لافقاريات (Z), لافقاريات 1 (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "إيثار أسعد سيد احمد حسين",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تصنيف زهري+فلورة(B), طحالب + تصنيف نبات (B), طحالب + تصنيف نباتB, مورفولوجي نبات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "إيمان حسن إسماعيل عبد الرازق",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "حشرات + طفيلياتZ, علم الحشرات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "اسماء محمود مغازي تمام",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فسيولوجيا النبات2 (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "الهام رافت عواد محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "سلوك حيوان + حيوان اقتصادي (Z), لافقاريات (Z), لافقاريات 1 (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ايناس صالح عبدالباقى عبدالكريم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "بيولوجية جسم الانسان (Z), فسيولوجي حيوان (Z), فسيولوجيا حيوان (Z), مدخل إلى بيولوجيا الانسان"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "رانيا جمال طه حسن",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "طفيليات + مناعة(z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "رباب مجدى عبد الجواد عبد الحليم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "حشرات + طفيليات (Z), علم الحشرات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "سحرمحمود عبد الباقى احمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الصخور(G), جيولوجيا عامة (G), جيولوجية عامة (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "عبد المنعم ابراهيم ابراهيم ابو العطا",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "ارشجونيات + تطور نبات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "عزيزة محمد محمد الوسيمى",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "حبليات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "فاطمة محمد على تقي الدين",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "حبليات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "محمد أحمد محمد إسماعيل",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "علم الخلية + بيولوجيا جزيئية (Z), علم الخلية وبيولوجيا جزيئيه (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "مني ابراهيم عيسى محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "أجنه (Z), خلية + بيولوجية جزيئية + أجنة (Z), خلية + بيولوجية جزيئية + أجنةZ"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "نجوان حمدي محمد عطية",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تشريح نبات (B), مورفولوجي نبات (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "وفاء عبد العزيز على شحاتة",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "البلورات + المعادن (G), بلورات ومعادن (G), خامات ورواسب معدنية (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أحمد راضى محمد ابراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "احياء مائية (Z), الاوبئة والصحة العقلية, التغير المناخي والإستدامة في مصر, الجودة البيئية والاتصالات, الصحة واللياقة والمتابعة, الطعام والتغذية في مصر"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أحمد عصام الدين محمد جلال",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فلك (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أمنية السيد زكى السيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جيولوجيا تركيبية (G), جيولوجيا عامة, جيولوجيا هندسية (G), جيومورفولوجى (G), صخور نارية ومتحولة (G), صخور ناريه ومتحوله (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "أميرة محمد محمود عبدالهادى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أسس علم النبات (B), فيروسات+ بكتيريا (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "السيد أحمد السيد حافظ",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مدخل إلى بيولوجيا الانسان"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "جمال رمضان سلامة محمد سلامة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جيولوجيا تاريخيه (G), جيولوجيا عامة (G), جيولوجية مصر (G), حفريات كبيره (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "حسنية عبده خليل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "بيئة نباتية (B), بيئة نباتية B"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "خالد أحمد محمود جمعة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أسس علم الحيوان, أسس علم الحيوان (Z), بيولوجيا جسم الانسان (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ربيع عبد التواب ثابت شهاب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "طحالب (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "رحاب مصطفي محمد مصطفي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "طحالب + تصنيف نبات (B), طحالب + تصنيف نباتB"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "سحر حسن هارون حسن صبح",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حشرات + طفيليات (Z), حشرات + طفيلياتZ"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "طه عبدالشافى عبدربه صالح",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أسس علم الحيوان (Z), تطبيقات علم الاحياء في الحياة"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "عبير رفعت خليفه شريف",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الطاقة الحرارية في نظام الأرض, تطبيقات العلوم في الحياة, جيولوجيا عامه (G), حفريات وطبقات (G)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "عبير مصطفى بيومي محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تطبيقات علم الاحياء في الحياة, مدخل إلى بيولوجيا الانسان"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "غادة سعد فتوح احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "طفيليات + مناعة(z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "فاطمة أحمد أبو العزم ابراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "لافقاريات (Z)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "ليلى محمد احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "بيئة نباتية B"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "هاله سمير سعد الدين سيد بدير",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تكنولوجيا حيوية, نبات تقسيمي (B)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم العلوم البيولوجية والجيولوجية",
      "اسم الأستاذ": "هبه زكريا عبد السميع سليمان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حشرات + طفيليات (Z)"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "مني صلاح الدين حسنين محمود",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الشعر الرومانسي و الفيكتوري, الشعر الرومانسي والفيكتوري, النقد 3, تاريخ الأدب الإنجليزي, شعر 2, شعر القرنين 18 و19"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "آمال طايع محمود عبد الرحمن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم الأساليب"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "أحمد حسن أحمد حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الدلالة و التداولية, الدلالة والتداولية, تحليل الخطاب, مدخل الي علم اللغة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "أحمد عبد الستار عبد العزيز كشك",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب الأطفال: وجهات نظر, أدب الطفل, الكتابة المتقدمة, كتابة 2"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "أمل صلاح الدين عبد العزيز علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اللغة الإنجليزية (7), تاريخ اللغة الإنجليزية, تاريخ اللغة الانجليزية, تحليل الخطاب, علم الصرف والتركيب, قواعد (1)"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "أمل محمد رشاد السيد أبو هيبة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الرواية الحديثة والمعاصرة, اللغة الإنجليزية (5), مبادئ الكتابة, مقدمة في الدراما والقصة, نقد حديث"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "الهام جمال عبد المجيد أحمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب مقارن, اساليب القراءة والفهم, دراما 2, دراما 3, كتابة (1) (الوصفية والقصصية), كتابة 1"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "ايناس محمد السعيد علي بدوى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اللغة الانجليزية, ترجمة 2, قراءة 1, مبادئ الترجمة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "جيهان يوسف اسماعيل اسماعيل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الشعر الحديث والمعاصر, قراءة نقدية, مدخل الي النقد الأدبي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "حنان نبيل يوسف عبده",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل الخطاب, تدريبات لغوية (1), علم الصرف والتراكيب, علم الصرف والتركيب, علم اللغة التطبيقي, قواعد وتدريبات لغوية, قواعد وتدريبات لغوية (2), مدخل إلى علم اللغة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "سامية مسعود السيد أبو سكينة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل تقابلي و تحليل أخطاء, تحليل تقابلي وتحليل أخطاء, علم اللغة الاجتماعي والنفسي, علم اللغة النفسي والاجتماعي, علم المعاجم, مهارات الترجمة والقاموس"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "سلوى جودة محمد محمد عزب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الترجمة الإعلامية والأدبية, الترجمة الاعلامية والادبية, دراما القرنين 18 و19, شكسبير, نقد حديث"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "شيرين يوسف محمد علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب مقارن, ادب مقارن, اللغة الإنجليزية (6), رواية القرن التاسع عشر, فن القصة, قراءة نقدية, قصة 2"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "عبير كمال محمود الخطيب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استماع وتحدث 2, الرواية في عصر التنوير, قصة 2, مبادئ الكتابة, مدخل إلى الدراما والقصة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "غادة جمال محمد جمال",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب امريكي, الترجمة الي الإنجليزية, الشعر الحديث والمعاصر, اللغة الإنجليزية (8), ترجمة الي الإنجليزية, مدخل إلى الشعر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "فاتن محمد المصري حسن شلبي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "دراما, دراما القرن العشرين, مدخل إلى النقد, مقدمة في الدراما والقصة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "ماجدة إبراهيم طاهر عبد الحميد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "دراما القرن العشرين"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "مصطفي إبراهيم طه عيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الدلالة والتداولية, تحليل الخطاب, تحليل تقابلي وتحليل أخطاء, علم لغة المتون, مدخل إلى علم اللغة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "منتصر محمود عباس الشوربجي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم لغة المتون"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "مها وفائي عشماوي قطب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الشعر الرومانسي والفيكتوري, الكتابة المتقدمة, اللغة الإنجليزية (3), اللغة الإنجليزية (4), تاريخ الأدب الإنجليزي, تاريخ الادب الانجليزي, كتابة متقدمة, كتابه(2)(الجدليه), مدخل الي الشعر الإنجليزي, مهارات التواصل"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الإنجليزية",
      "اسم الأستاذ": "نها أحمد رضوان عثمان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الترجمة الي العربية, الرواية الحديثة والمعاصرة, اللغة الإنجليزية (1), اللغة الإنجليزية (2), رواية القرن 18, رواية القرن التاسع عشر, قراءة تحليلية, مبادئ الكتابة والترجمة التحريرية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "احمد سعد محمد سعد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "مدخل إلى البلاغة العربية, مدخل إلى النقد العربي"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "احمد محمد فؤاد مصطفى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أدب عربي حديث نثر, اتجاهات النقد الأدبي الحديث, اتجاهات النقد المعاصر, النقد العربي الحديث"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "اشرف محمود حنفى نجا",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أدب أندلسي, نقد يوناني قديم"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "امال ابراهيم مصطفى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أدب عباسي (1), أدب عباسي (2)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "حسن محمد عبد المقصود",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تدريبات لغوية وأدبية, نحو وصرف (1)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "فتحى عبد المحسن محمد حمدان",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الأدب الإسلامي والأموي"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "ماهر محمود عميرة",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "نحو وصرف (1), نحو وصرف (2), نحو وصرف (3)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "نجلاء عبدة محمد العدلي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علوم قرآن"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "وائل على محمد السيد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أدب طفل, أدب عربي حديث - شعر, أدب مصر الإسلامية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "العربى حسن حسين درويش",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تحليل النصوص الأدبية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "دعاء سميح عبد السلام",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "علوم الحديث, علوم حديث"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "سارة سمير عبدالحكيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "أسلوبيات, اتجاهات النقد المعاصر, اللغة العربية (3), تدريبات لغوية وأدبية, نقد عربي قديم"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "محمد الطاهر احمد محمود محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اللغة العربية (1), علم اللغة التطبيقي, علم المعاجـم والـدلالة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "هاني إبراهيم الدسوقي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الصرف العربي, نحو وصرف (4)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "يسن على رمضان محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اتجاهات النقد المعاصر, اللغة العربية (2), علم المعاني"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "ابراهيم احمد ابراهيم ابو حمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "البلاغة العربية (علم المعاني), علم البيان"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "اسماء جمال حمزة هاشم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أصوات لغوية, مدخل إلى علم اللغة والبلاغة العربية, مصادر أدبية ولغوية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "امانى محمد سعد محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب عربي حديث شعر ونثر, اللغة العربية (7)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "امنية محسن محمد القصاص",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب جاهلي, اللغة العربية (6), المكتبة العربية, مدخل إلى الأدب العربي"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "اميرة بدوى محمد سليمان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب مصر الإسلامية, الأدب في مصر الإسلامية, اللغة العربية (4)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "اميمة محمد عبد العزيز ركابى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "دراما ومسرح طفل, مصادر أدبية ولغوية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "انور احمد احمد بدوي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم اللغة التطبيقي, علم المعاجم والدلالة, فقه اللغة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "حسام محمد السيد عقل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب عربي حديث نثر"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "داليا محمود على حسنين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم البديع"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "سالم عبد الخير فرماوي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "عروض (1), عروض وقافية (2)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "شيماء السيد محمد الطوخى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التحرير الكتابي, علم البيان, مدخل إلى علم اللغة والبلاغة العربية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "شيماء محمود حامد حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تفسير وتجويد, قضايا إسلامية معاصرة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "عاشور محمود عبدالنبى محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اتجاهات النقد الأدبي الحديث, اللغة العربية (5), تحليل النصوص الأدبية, عروض وقافية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "عصمت محمد يعقوب عثمان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب جاهلي, الأدب الإسلامي والأموي"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "لبنى حسنى على سالم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قراءة في كتاب قديم (أدب)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "محمد حسن أبو العز",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فقه العبادات, فقه العبادات والمعاملات"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "مروة عبد الحميد حسن احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تدريبات لغوية وأدبية, نحو وصرف (2), نحو وصرف (3), نحو وصرف (5)"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "منى عبد الحميد محمود خليل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "النصوص القرآنية (تجويد), قضايا إسلامية معاصرة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "نجلاء حسن صالح محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الصرف العربي"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "نجلاء حسنى ابراهيم عبد الجواد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب عباسي, أدب عباسي (2), مدخل إلى الأدب العربي"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "ندى عبد المنعم السيد على",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فقه المعاملات, قضايا إسلامية معاصرة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم اللغة العربية والدراسات الإسلامية",
      "اسم الأستاذ": "هند سعد محمد سالم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب عربي حديث شعر, تحليل النصوص الأدبية, تدريبات لغوية وأدبية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "بسمة أسامة السيد فؤاد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التدخل المبكر والإرشاد الأسري"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "جيهان حسين حسن علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "سيكولوجية القيادة واتخاذ القرار, مدخل إلى اضطراب التوحد, مناهج بحث في علم النفس"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "دعاء محمود زكي على",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التنمية اللغوية والتدريب الكلامي, تكنولوجيا ذوى الاحتياجات الخاصة, طريقة برايل للمكفوفين"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "رضا خيري عبد العزيز حسين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تأهيل ذوي الاحتياجات الخاصة., دمج ذوى الاحتياجات الخاصة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "زينب رضا كمال الدين عبد الحليم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "دمج ذوي الاحتياجات الخاصة, قراءات باللغة الإنجليزية في التربية الخاصة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "سامية سعيد محمد عبد المقصود",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الدوافع والانفعالات, برامج ذوي الاحتياجات الخاصة, مبادئ تعليم ذوى القدرات الخاصة واستراتيجاته, مواهب ذوي الاحتياجات الخاصة"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "سمر رجب حافظ فرج",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مبادئ القدرات الخاصة واستراتيجاتها"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "شيماء بهي الدين مصطفى أحمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "دمج ذوى الاحتياجات الخاصة, سيكولوجية التواصل, صعوبات التعلم النمائية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "عبد الحميد عادل محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التشخيص والتقييم في مجال التوحد, طرائق تعليم ذوي اضطراب التوحد, علم النفس الأسري, علم نفس الشخصية"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "علية مجدي محمود عبد الفتاح",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات تعديل السلوك., الدمج بين النظرية والتطبيق"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "غادة مصطفى محمد الصادق",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاضطرابات السلوكية والانفعالية., سيكولوجية التفكير والابداع"
    },
    {
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية الخاصة",
      "اسم الأستاذ": "فاطمة السيد عبد المقصود الجارحي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تشخيص وتقييم ذوي الاحتياجات الخاصة., دمج ذوي الاحتياجات الخاصة, سيكولوجية الكبار من ذوي الاحتياجات الخاصة, علم نفس بيئي, علم نفس تكيفي"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "أحمد محمد اسماعيل محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "ديناميكا كهربية, كهربية ومغناطيسية, كهرومغناطيسية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "أشجان محمد فريد السيد أحمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "طاقات جديدة ومتجددة, فيزياء عامة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "أميرة محمد حسنين محمود شقرة",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "اهتزازات وموجات وحرارة, بصريات هندسية, فيزياء المواد, كهرومغناطيسية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "اشرف السيد بخيت محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "إلكترونيات"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "ايناس عبد الفتاح أحمد الشاذلى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "اهتزازات وموجات, خواص مادة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "جيهان فاروق عبده سالم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "بصريات هندسية, خواص مادة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "دعاء محمود حبشى عبد الرحمن",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "ديناميكا تحليلية, معادلات تفاضلية ودوال خاصة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "رشا علي علي محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "استاتيكا ومتجهات, ديناميكا الموائع"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "سامى الجمل محمد الجمل",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "خواص مادة وحرارة, دوائر منطقية ورقمية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "عبير سيد فريد السيد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كهربية ومغناطيسية, كهربية ومغناطيسية وبصريات هندسية, كهربيه ومغناطيسيه وبصريات هندسيه"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "عصام جمال المتولي إبراهيم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "بصريات هندسية, بصريات هندسية وصوت, ديناميكا حرارية, فيزياء عامة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "عطية عبدالمطلب عطية حسن",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "دوائر منطقية ورقمية, ديناميكا كهربية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "علاء الدين عبد الحليم محمد فرج",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "اهتزازات وموجات, صوت"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "كرم فتحى عبد الرحمن على حسن",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الفيزياء في علوم الصحة, فيزيا ء الجوامد"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "مرفت اسماعيل محمد عبدالشافي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "اهتزازات وموجات وحراره, خواص مادة وحرارة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "مصطفى أحمد محمود محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "خواص مادة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "مصطفى محمد مصطفى حسين",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "ديناميكا حرارية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "هاني نظمي سليمان هرمينا",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "حرارة, فيزياء جوامد"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "هبه الغريب عطيه الجمل",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكترونيات, تيار متردد"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "هند علي محمد علي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "حرارة, فيزياء الليزر, فيزياء المواد, كهربية ومغناطيسية وبصريات هندسية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "آمال محمد ياسين حميد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "بصريات هندسية وصوت"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "أشرف سيد محمود عوض الله",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تيار متردد, حرارة وديناميكا حرارية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "ايمان محمد عاصم محمد محمود",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فيزياء عامة, كهربية ومغناطيسية ودوائر الكترونية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "حنان سيد محمد سيد أحمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اهتزازات وموجات وحرارة, خواص مادة وحرارة, فيزياء حديثة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "شيرين محمد عبد العزيز السبد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "بصريات فيزيائية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "غادة محمد ابراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تطبيقات الفيزياء في الحياة, خواص مادة وحرارة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "فاطمة السيد عبد العزيز ابراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فيزياء حديثة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "ممدوح محمد عبد العزيز",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كهربية ومغناطيسية ودوائر الكترونية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "مها محمود موسى",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تطبيقات الفيزياء الموجية (الاشعة الكونية والجسيمات الأولية), كهربية ومغناطيسية وتيار متردد"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "نهال صبري خليل محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فيزياء اشعاعية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "هانم ابراهيم محمد لبدة",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "احتمالات واحصاء, ميكانيكا الكم"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "هيام عثمان طه ابراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تطبيقات ميكانيكا الكم"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "اسامة اشرف يوسف عبدالعزيز",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فيزياء نووية, نماذج نووية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "اسلام سلامه سعد سلامه",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فيزياء عامة, كهربية ومغناطيسية وتيار متردد"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "انجي هاني علي علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استخدام الحاسب في الفيزياء, معادلات تفاضلية ودوال خاصة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "دينا محمد عبد المقصود عبد الرازق",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فيزياء نووية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "سامية سيد مصطفي شعبان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "ديناميكا الموائع, فيزياء حسابية, ميكانيكا الكم (1)"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "فاطمة السيد عوده سليمان الشيمي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فيزياء إحصائية, فيزياء حسابية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "فيروز فهيم ونيس بركات",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اهتزازات وموجات, فيزياء حيوية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "محمد محمد عبد الحفيظ حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أسس الطاقة, فيزياء فلكية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "مرام محمد عبد المجيد منصور",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قراءات فى التخصص باللغة الإنجليزية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "نهاد داود حبيب جرجس",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "خواص مادة, خواص مادة وحرارة"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الفيزياء",
      "اسم الأستاذ": "نورا سامى صدقى محارب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فيزياء فلكية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "السيد مدبولي إبراهيم سلمي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "قراءة 3, قراءة 4"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "رانيا مصطفى إسماعيل الوردى",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ الأدب الألماني, نظريات التواصل بين الحضارات"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "صلاح الدين سعد فريد هلال",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تحليل النصوص الأدبية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "امجد محمود اسعد سيد مطر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حضارة 1, علم لغة 1, قواعد 2"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "ايمان رجب محمود عبده",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كتابة 2"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "ريتشارد فيديرسين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل الأخطاء, علم اللغة التطبيقى"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "سوزان روبي عبد الباسط طلب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب 2, قراءات أدبية عبر العصور"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "عبد الرحمن محمد ناجي عبد الغني",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم اللغة البراجماتي, كتابة 3"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "عبدالرحمن عوض عباس علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حضارة 2, مدخل فى علم الأدب"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "عبير عمر حسن محمد مرزوق",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قضايا مجتمعية"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "فاطمة الزهراء محمد عبد العظيم محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قراءة 1, كتابة 1"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "نادية أحمد أحمد عباس",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم لغة النص"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "ناصرة محمود محمد عبد الفتاح",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قراءة 6, قواعد 6"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "نورالهدى عبد التواب عبدالواحد القاضي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قواعد 5, كتابة 4"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "هبة أحمد محمود إمام",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قواعد 1"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "هدى محمد سليمان عبد المولى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كتابة 5, كتابة 6"
    },
    {
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الألمانية",
      "اسم الأستاذ": "مها محمد رضا هندي عبد الله",
      "الدرجة العلمية": "مدرس مساعد",
      "اسم المقرر": "كتابة 3"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "أميمة محمد ابراهيم عدلي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء غير العضوية العامة"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "سامح محمد كامل أبو الفتوح",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء الحفز والسطوح"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "سحر عبد الدايم السيد محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تطبيقات الكيمياء في الحياة"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "سومية محمد عبد الكريم مصطفي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "البوليمرات والأصباغ, المجموعات الفعالة في الكيمياء العضوية, كيمياء عضوية (1)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "شيماء عبد الحليم حسين احمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء الكم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "عادل عباس أحمد عمارة",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء التماثل ونظرية المجموعات"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "عزه محمد محمد القزق",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء الاروماتية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "عقيلة امين صالح لبيب",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء التناسقية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "علي محمود طه أحمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء غير العضوية الحيوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "كامليا محمد المهدي نادى مهدي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تطبيقات الكيمياء في الحياة, كيمياء عضوية, مقدمة فى الكيمياء"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "مجدى أحمد محمد إبراهيم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء عضوية طيفية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "مجدي شبل صالح السيد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء العناصر الانتقالية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "محمود محمد عبدالحميد مشالي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "طرق التحليل الطيفي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "مروه محمد ابراهيم حسن",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء الحركية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "منى مصطفى على محمد سيف",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء البيئية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "مى صالح عبد المقصود حسين",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الكيمياء الضوئية وتطبيقاتها, كيمياء انتاج الطاقة واستهلاكها"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "ناصر محمد عبدالفتاح احمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تطبيقات الكيمياء في الحياة, مبادئ الكيمياء العضوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "نبل فؤاد محمد محمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء فيزيائية, كيمياء فيزيائية تطبيقية (2), كيمياء كهربية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "هاله رشاد أحمد محمود",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "كيمياء فيزيائية تطبيقية (1)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "هاني محمد محمد حسنين",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "ميكانيكية التفاعلات العضوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "أسامة فاروق محمد إبراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "أسس الطاقة, الجودة البيئية والاتصالات, الكيمياء الحيوية, تطبيقات الكيمياء الحيوية في الصحة العامة والدواء, كيمياء عامة 1, مقرراختياري فى علوم الأغذية والتكنولوجيا والمجتمع: الأطعمة المُعدَّلة وراثيًا"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "أسماء إسماعيل نبيل محمد فهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء الجزيئات الحيوية, كيمياء حيوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "أميرة على محمد على",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "طرق التحليل الحجمي والوزني, كيمياء غير عضويه"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "الشيماء بدران عبدالمنعم محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "المجموعات الفعالة في الكيمياء العضوية, كيمياء عضويه"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "الهام سيد عثمان سيد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الكيمياء الفراغية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "حسن عبد الله حسان الليموني",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء البوليمرات"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "رانيا احمد فؤاد ابراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء عامة, كيمياء عامة 2"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "رغدة كمال الدين حسين عبد الحميد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التغير المناخي والإستدامة في مصر, كيمياء فيزيائية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "سمية محمد محمد الإدفاوي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الكيمياء الاروماتية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "فاطمة سامي عبدالسلام إبراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الكيمياء التحليلية, كيمياء الجدول الدوري"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "فوز محمد السيد عمر",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التحليل باستخدام الأجهزة, طرق التحليل الطيفي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "محمد عبد الحميد عبد الجواد عويس",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء المنتجات الطبيعية, كيمياء عامة 1, كيمياء عضوية (2)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "محمد مصطفي محمود ابراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء عامة"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "مسعد عبد الرحمن الغمرى راغب",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء عامة, كيمياء نووية وإشعاعية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "منى على أحمد نغمش",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "أساسيات الكيمياء الفيزيائية, تطبيقات الكيمياء في الحياة"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "مي عبد اللطيف مصطفي محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الطعام والتغذية في مصر, الكيمياء العضوية الاليفاتية, كيمياء المركبات غير متجانسة الحلقة, مبادئ الكيمياء العضوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "نشوه سعد عبد الشافي محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء التأكل وطرق الحماية, كيمياء تطبيقية فيزيائية (2)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "هدى فتحي عثمان الشافعي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "طرق التحليل الحجمي والوزني, كيمياء المجموعات الرئيسية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "وفاء رمزي عبد المنعم علي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "كيمياء الجزيئات الحيوية, كيمياء عضوية (1), كيمياء عضوية (2)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "ابتسام محمد عبد الرحمن اسماعيل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الكيمياء البيئية, كيمياء عامة, مقدمة فى الكيمياء"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "الشيماء إبراهيم عبد الحليم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كيمياء حاسوبية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "حنان عاطف سليمان عبيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كيمياء الحالة الصلبة, كيمياء الحفز والسطوح, كيمياء عامة (2), كيمياء فيزيائية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "داليا عبد القادر عباس الشوبري",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كيمياء المنتجات الطبيعية, كيمياء عضوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "دعاء فتحي محمد سلام",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كيمياء عامة, كيمياء عامة (1), كيمياء نووية وإشعاعية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "رنا حلمي عبده عبد الحميد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كيمياء عامة (1)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "سعاد مجدي تادرس ميخائيل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "ديناميكا حرارية, كيمياء فيزيائية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "نهى محمد احمد حسنين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "البوليمرات والأصباغ, الكيمياء العضوية الاليفاتية, كيمياء الأصباغ, كيمياء البوليمرات"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الكيمياء",
      "اسم الأستاذ": "هبه حسن ابراهيم حرحش",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "كيمياء عضوية (2), ميكانيكية التفاعلات العضوية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "امل عبد الفتاح عطوة شمس",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علم الاجتماع التنمية, علم الاجتماع التنمية (SOC), مهارات العمل التطوعي والتنمية الاجتماعية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "نيفين زكريا محمد أمين",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علم الاجتماع السياسي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "انجي حمدي عبد الحافظ محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فلسفة التكنولوجيا"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "ايمان محمد محمد عمران",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الأخلاق والحضارة (PHI)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "دعاء احمد توفيق",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الاتجاهات المعاصرة فى الفلسفة والاجتماع"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "رباب جلال البصراتي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "مهارات الاتصال الاجتماعي والإعلامي (SOC)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "مني حسني احمد زيادة",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "قراءات في الاجتماع باللغة الأجنبية (SOC)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "اية مصطفي محمد غريب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الفلسفة والإنسانيات (PHI), فلسفة حديثة (2), فلسفة معاصرة (1)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "رويدا السيد ابو العلا",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مدخل إلى علم الاجتماع (SOC)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "سماح عبد الحكيم عمارة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاخلاق التطبيقية, مهارات التفكير النقدي (PHI)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "فاطمة بكر سيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "البناء الثقافي للحضارة, فلسفة القانون, فلسفة القانون (PHI), فلسفة سياسية (PHI), فلسفة سياسية حديثة, فلسفة سياسية حديثة (PHI)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "لبني محمد فتوح",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "العمل التطوعى والمجتمع المدنى"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "محمد وهبة عفيفي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الأخلاق والحضارة (PHI), فلسفة اسلامية (المغرب) (PHI), مهارات التفكير النقدي (PHI)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "هالة صبحي اقلاديوس",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المنطق الرمزي (PHI), المنطق الصوري (PHI), فلسفة العقل (PHI), قراءات فى الفلسفة باللغة الإنجليزية, قراءات في الفلسفة باللغة الإنجليزية (PHI), مناهج بحث تطبيقية (PHI), منطق رمزي"
    },
    {
      "اليوم": "الخميس",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الفلسفة وعلم الاجتماع",
      "اسم الأستاذ": "ياسمين محمد محمود",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاخلاق والحضارة (PHI)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "زينب شعبان رزق أحمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "أساليب التعليم والتعلم القائمة على الاستقصاء والتصميم, أسس التعليم في مدارس STEM المصرية: النظرية والتطبيق, إحصاء استدلالي, اساسيات البحث التربوى, الاتجاهات المعاصرة فى علم النفس التربوى"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "ياسمين عبد الغنى سالم عبد الغنى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "علم النفس المدرسي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "أحمد عباس منشاوي عباس",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الاتجاهات المعاصرة في علم النفس, السلوك وتعديله, الفروق الفردية, تقييم التعلم, علم نفس معرفي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "أمينة عبد الفتاح عبد الله علي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "سيكولوجية الموهوبين, علم النفس الفسيولوجي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "إسلام حسن على حسن",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الفروق الفردية, المعرفة والتعلم: تطبيقات مدرسية, تقييم التعلم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "اشرف عبد الفتاح عبد المغني محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الإحصاء النفسي (وصفي)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "رياض سليمان السيد طه",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الاتجاهات المعاصرة في علم النفس, الفروق الفردية, المعرفة والتعلم: تطبيقات مدرسية, دمج ذوي الاحتياجات الخاصة, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "صبرين صلاح ثعلب عبد ربة",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تقييم التعلم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "عائشة احمد أبو سريع السيد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الفروق الفردية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "مجدى شعبان أمين محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اتجاهات معاصرة في علم النفس, التكنولوجيا المتقدمة : الذكاء الاصطناعي في STEM, التكنولوجيا وتحليل البيانات فى تخصصات STEM, علم البيانات والنمذجة والاستقصاء 1, علم البيانات والنمذجة والاستقصاء 2"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "نيفين صباح بيومي أحمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ علم النفس, سيكولوجية صعوبات التعلم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "وليد حسن عاشور حسن الخطيب",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تقنيات حديثة في علم النفس"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "أسماء عبد اللطيف احمد عبد اللطيف",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاتجاهات المعاصرة في علم النفس, الفروق الفردية, المعرفة والتعلم: تطبيقات مدرسية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "أمال أحمد فتحي دسوقي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المعرفة والتعلم: تطبيقات مدرسية, بناء الاختبارات النفسية والتحصيلية, بناء الاختبارات النفسية., تقييم التعلم, علم النفس المهني"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "إيمان نجم عبد الكريم عبد العزيز",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اتجاهات معاصرة في علم النفس, الفروق الفردية, القياس النفسي., المعرفة والتعلم: تطبيقات مدرسية, تقييم التعلم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "رانيا محمد محمد احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الفروق الفردية, تقييم التعلم, قراءات باللغة الانجليزية في علم النفس"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "زهراء محمد فريد حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاتجاهات المعاصرة في علم النفس, الذكاء: نظريات وتطبيقات, الفروق الفردية, المعرفة والتعلم: تطبيقات مدرسية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "سلمى محمد ابراهيم حسان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المعرفة والتعلم: تطبيقات مدرسية, مدخل إلى الطب النفسي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "محمد عبد العظيم أحمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المعرفة والتعلم في تخصصات STEM, علم النفس التجريبي, قراءات في علم النفس المدرسي باللغة الانجليزية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "محمود سعيد عطية إبراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المعرفة والتعلم: تطبيقات مدرسية, تاريخ علم النفس, تقنيات حديثة في علم النفس, تقييم التعلم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "نادر مسعد محمد احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "إحصاء استدلالي, الإحصاء النفسي (وصفي), الاحصاء النفسي الاستدلالي, الاحصاء النفسي الوصفي, القياس النفسي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "نها أحمد عاشور أحمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاتجاهات المعاصرة في علم النفس, تقييم التعلم, علم نفس إيجابي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم علم النفس التربوي",
      "اسم الأستاذ": "هيام السيد خليل سعد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الفروق الفردية, سيكولوجية الوجدان, علم نفس اجتماعي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "أشرف محمد عبد الرحمن مؤنس",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تاريخ العرب الحديث والمعاصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "انور محمود حلمى على",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تاريخ المغرب والأندلس, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "ايمان مصطفي عبد العظيم سالم",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "جمال معوض محمود شقرة",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "جيهان رشدى محمد السيد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "التاريخ المصري القديم, تاريخ مصر, حضارة مصر القديمة, معالم التاريخ المصري القديم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "مصطفي احمد ابراهيم شلبي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "تاريخ الحضارات, مصطلحات وقراءات في التاريخ باللغة الإنجليزية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "هالة محمود محمد خلف",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الفنون والعمارة في مصر القديمة, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "احمد السيد احمد عبدالرؤف",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية القومية, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "انجى محمد احمد خلف جنيدى",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "محمد عبدالباسط محمد العناني",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ الولايات المتحدة الأمريكية, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "مرفت عثمان حسن على",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ الأيوبيون والمماليك"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "هبة عبدالمقصود مرسي عبد الله",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ الدولة العربية الإسلامية وحضارتها"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "أحمد ضياء الدين محمد بيومى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التاريخ المصري القديم وتاريخ الشرق الأدنى القديم"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "الشيماء فتحي محمد أحمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التاريخ اليوناني والروماني وحضارته, معالم تاريخ الرومان, معالم تاريخ اليونان"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "امل يوسف عبدالله معوض",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التاريخ الأوروبي الوسيط, حضارة أوروبا في العصور الوسطى"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "اية محمود أحمد قبيصي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ أوروبا الحديث والمعاصر, تاريخ العرب الحديث والمعاصر, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "دعاء سيد حسين محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الدولة العثمانية والعالم العربي, تاريخ العرب الحديث, تاريخ العرب المعاصر, تاريخ العلاقات الدولية الحديثة والمعاصرة, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "رجب محمد بشير ابراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "رشا محمد احمد امين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ أفريقيا الحديث والمعاصر, تاريخ دول حوض النيل, تاريخ مصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "سعاد علي مجاهد مجاهد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مصر في العصرين اليوناني والروماني"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "شيماء محمد صبحي عبد السلام",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ أسيا الحديث والمعاصر, تاريخ مصر, مدخل إلى علم الوثائق (الأرشيفات)"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "صفاء عبدالشافي محمد عبد الموجود",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مصر في العصر الإسلامي"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "علي ابراهيم عبد اللطيف محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ مصر الحديث"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "محمود عبد القادر عبد القادر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ مصر, تاريخ مصر والشام فى العصور الوسطى"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "هبة شوقي إسماعيل محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ مصر الحديث, تاريخ مصر المعاصر"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "هدى محمد محمد تونسي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ الدولة العباسية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "ولاء وجيه عبد الحميد عبد الغنى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "العلاقات بين الشرق والغرب في ع. وسطى, تاريخ الأيوبيين والمماليك, تاريخ الدولة العباسية, تاريخ مصر, تاريخ مصر الاسلامية"
    },
    {
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التاريخ",
      "اسم الأستاذ": "ياسر السيد عبد الخالق بدران",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تاريخ مصر"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "اسماء فتحى السيد محمد العليمي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "موائع, موائع (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد احمد حسن جابر",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "استاتيكا 2, ديناميكا"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد حسن هارون حسن",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "موائع (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد يحيى أبوزيد نصار",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "موائع"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "أمل عبد الحافظ عبد المنعم عبده الجيار",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تحليل احصائي"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "حامد محمود سيد علي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "رياضيات حيوية, موائع, ميكانيكا كم"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "خالد أحمد شوقي أحمد العجمى",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "حسبان (1), ديناميكا (2), رياضيات حيوية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "دعاء رشدي مصطفى محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "نظرية الاضطراب"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "سلام ناجي سلام شلبي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "جسم جاسئ, ميكانيكا الجسم الجامد"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "فاطمة محمد عبد الفتاح",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "بحوث العمليات"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محسن حنفي محمد موسي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "استاتيكا (1), ديناميكا (1), ديناميكا تحليلية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد فوزى السيد عامر",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التكنولوجيا وتحليل البيانات فى تخصصات STEM, الصحة واللياقة والمتابعة, تطبيقات موسعة للتفاضل والتكامل في مجالات STEM 2, تطبيقات موسعة للتفاضل والتكامل في مجالات STEM1, علم البيانات والنمذجة والاستقصاء 1, علم البيانات والنمذجة والاستقصاء 2"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "ندا سيد على جاد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "استاتيكا (1), استاتيكا (2), ديناميكا (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "هبة الله محمد عرفه محمود",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تطبيقات الرياضيات في الحياة"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "أسماء عاشور مصطفى خليل بدر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "إحصاء وصفي وتحليلي, تطبيقات الرياضيات فى الحياه, قراءات في التخصص باللغة الإنجليزية, مقدمة في الاحصاء"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "أشرف فؤاد محمد احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل حقيقي, تحليل مركب, معادلات تفاضلية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "إسراء مجدى عبد الغنى عبد الله",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "احتمالات, تفاضل وتكامل"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "احمد جمال عطا محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل عددي, تطبيقات الرياضيات فى الحياه, فلسفة وتاريخ الرياضيات"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "الشيماء عبد الباسط محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جسم جاسئ, ديناميكا تحليلية, ميكانيكا الجسم الجامد"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "امانى محمد عبد الحميد المنشاوى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جبر, مقدمة في نظرية العدد والمنطق, هندسة تحليلية (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "ايمان سعيد محمد يحيى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل مركب, توبولوجي"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "حميده السيد احمد جادالله",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "معادلات تفاضلية (2), معادلات تفاضلية جزئية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "حنان على عبده على فرحات",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل دالي"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "سهام شبل طنطاوى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جبر, معادلات تكاملية, هندسة تحليلية (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "سيد احمد كامل سيد احمد الماحي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "هندسة تحليلية (2), هندسة تفاضلية, هندسة فراغية, هندسة مسلمات"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "عادل يونس حسن يونس",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل عددي, حسبان (3)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "عبد العزيز رمضان يوسف رمضان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "ديناميكا تحليلية, ميكانيكا كم"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "عفاف حسن محمد حسن مطر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جبر, هندسة فراغية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "علية محمد خليل خطاب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حسبان (1), هندسة فراغية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محسن صوفى حسان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "معادلات تفاضلية, معادلات تفاضلية (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد عبدالله بكرى حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "النظرية النسبية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد مصطفى حسن محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حسبان (2), ميكانيكا الكم"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمد مصطفي ياقوت",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل مركب, توبولوجي, حسبان (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمود حامد طه احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "برمجيات للتطبيقات الرياضية والاحصائية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمود رأفت محمود سليمان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل احصائي"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمود سعد مهني محمود",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جبر خطي, نظرية الزمر"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمود عطيه محمد ابوالعلا",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تحليل احصائي"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "محمود همام عثمان سالم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الاحتمالات, مقدمة في الحاسب الآلي, مقدمة في نظرية الاحتمالات"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "مها حلمى إبراهيم البارودى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جبر (2), نظريات الحلقات والحقول, نظرية الزمر"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "نادية علي شحاته سلطان",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جبر (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "هانى بخيت لطيف بخيت",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "برمجيات للتطبيقات الرياضية والاحصائية"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "هبة علي حسن محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حسبان (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "هبه مصطفي عطيه احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تفاضل وتكامل, مقدمة في الحاسب الآلي, هندسة تحليلية مستوية, هندسة مسلمات"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "ياسمين مصطفى محمد عبد الفتاح مصطفى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استاتيكا, استاتيكا (2), الفلك"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم الرياضيات",
      "اسم الأستاذ": "يمنى ياسر حسن محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "بحوث العمليات"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "ابتسام محمد عبد الخالق مصطفى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "قواعد ولغويات (4)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "غادة صابر محمد احمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "قواعد ولغويات (3)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "نيللي عبد الخالق علي الحداد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "نصوص القرن 19 (1), نصوص القرن 19 (2), نصوص القرن 20 (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "دينا أحمد محمد زعتر",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "ترجمة مهنية (3), نصوص القرن 20 (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "دينا محمد صلاح مهدي شافعي",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تاريخ لغة (2), تعبير كتابي"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "ريهام صبري محمد أبوباشا",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "ترجمة مهنية (4), قواعد ونظم الشعر"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "مرجريت ميمى موريس مرقس",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "مقال أدبى القرن 20 (1), نصوص القرن 20 (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "بسمة محمد محمد سعيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "نصوص القرن 20 (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "جاكلين رسمى مرقس قلدس",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أدب القرن 18, تاريخ لغة (1), قواعد ولغويات (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "جاكلين ناجي وديع فرح",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حضارة القرن 20"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "جيهان كميل يوسف أرتين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "قواعد (1), قواعد ولغويات (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "سامح سعيد على منسى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حضارة القرن 18, مقال وأدب القرن 19 (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "سمر جمال محمد تمام",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "نصوص القرن 19 (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "شاهيناز صبري محمد عبد العال",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مقال أدبى القرن 20 (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "صافيناز على عبد الستار السنباوى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "ترجمة مهنية (1)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "ليديا موريس صالح حنا",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حضارة القرن 19, حضارة القرن 20"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "ليلي نجيب مراد مصطفي كمال",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مقال أدبي القرن 19 (2)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "مريم طلعت ادوار حليم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "مقال أدبى القرن 19 (2), مقال أدبى القرن 20 (2), مقال أدبي القرن 20 (2), ورشة عمل ومهارات الكتابة (3)"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "هدي نعيم عبد الشهيد ملطي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "نصوص القرن 18"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "هناء حسن حسين حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "حضارة القرن 16"
    },
    {
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم اللغة الفرنسية",
      "اسم الأستاذ": "نيفين زكريا سيد",
      "الدرجة العلمية": "مدرس لغة",
      "اسم المقرر": "اللغة الفرنسية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "رشا حامد سيد حسن بندق",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "مبادئ الخرائط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "طلعت عبد الحميد احمد عبد العاطي",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "التغيرات المناخية, جغرافيا مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "محمد عبد السلام حسين عبد القوى",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "جغرافيا مصر, جغرافية افريقيا وحوض النيل, مصطلحات وقراءات فى الجغرافيا باللغة الأنجليزية 1"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "كامل مصطفي كامل سيد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تطبيقات نظم معلومات جغرافية والاستشعار من بعد, جغرافية الوطن العربى وجغرافيا العالم الإسلامى, جغرافية الوطن العربي وجغرافيا العالم الإسلامي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "هويدا توفيق أحمد حسن",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التغيرات المناخية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "أسماء فتحي ابراهيم عبد الحليم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التغيرات المناخية, جغرافيا مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "أمل محمود محمد ابراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا مصر, جغرافية السكان, خرائط التوزيعات"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "أيمن عطية عبدالحكيم بيومى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التغيرات المناخية, جغرافيا البيئات الطبيعية, جغرافيا طبيعية وجغرافيا البيئات الطبيعية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "احمد محمد السيد مصطفي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا مصر, مصطلحات وقراءات فى الجغرافيا باللغة الانجليزية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "اسماء عبده مصطفي عبد العزيز",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا الخدمات, جغرافيا مصر, جغرافية العمران, مبادئ الاستشعار من بعد"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "حسين ابراهيم حسين ابراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا مصر, خرائط التوزيعات, خرائط طبوغرافية, مساحة وخرائط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "حنان أحمد محمد يوسف",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا مصر, جغرافية السكان والجغرافيا الطبية, مبادئ الخرائط, مبادئ خرائط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "دعاء سيد أحمد حسن",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا اقتصادية وسياسية, جغرافيا بشرية وجغرافيا تاريخية, جغرافيا مصر, جغرافية التعدين والصناعة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "ريمون سمير شوقي بخيت",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا مصر, قراءات جغرافية باللغة الإنجليزية, قراءات فى التخصص باللغة الإنجليزية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "سلوى محمود حافظ عزازي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الجغرافيا البشرية, جغرافيا اقتصادية وسياسية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "سهير جلال عبد الرحمن العنانى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الجغرافيا الزراعية, جغرافيا مصر, جغرافية اوراسيا والجغرافيا الزراعية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "عصام عطية حسن أحمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "البحار والمحيطات, جغرافية البحار والمحيطات"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "عويس احمد الرشيدي حسين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافية مصر الطبيعية, جيومورفولوجيا"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "كاترين سامي عدلي حنين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "جغرافيا مصر, جغرافية التنمية, جغرافية الوطن العربي, جغرافية مصر والوطن العربي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "محمد جمال محمد زكي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الثقافة الجغرافية, جغرافية العالم الجديد"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "نسرين زكريا محمد ابراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التغيرات المناخية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "نهى حسنى مصطفى عفيفى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الجغرافيا البشرية, جغرافية العالم الجديد, جغرافية مصر البشرية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "نيرمين نتعى زهير حناالله",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التغيرات المناخية, الجغرافيا الطبيعية, جغرافية أفريقيا وحوض النيل"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "اسم الأستاذ": "هناء محمد عبد الوهاب عبد الهادي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "ارصاد جوية, التغيرات المناخية, جغرافيا مناخية وحيوية وارصاد جوية, مشكلات مناخية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "هبه محمد محمود عبدالعال",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "استراتيجيات التعلم النشط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "أمل كمال محمد رشاد جعفر",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تقييم التعلم, تكنولوجيا التعليم والتحول الرقمي, فلسفة التعليم فى مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "احمد كمال قرنى سيد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "استراتيجيات التعلم النشط, المنهج المدرسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "جيلان السيد كامل",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "تقنيات المعلومات والاتصال فى التعليم والبحث, تكنولوجيا التعليم والتحول الرقمي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "سالي كمال إبراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "أسس التعليم في مدارس STEM المصرية: النظرية والتطبيق, استراتيجيات التعلم النشط, المعرفة والتعلم في تخصصات STEM, المنهج المدرسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "شيرى مجدى نصحى مسيحة",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "استراتيجيات التعلم النشط, المنهج المدرسي, دراما ومسرح طفل"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "عصام محمد سيد أحمد محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "استراتيجيات التعلم النشط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "محمد سيد أحمد عبده عبد العال",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "استراتيجيات التعلم النشط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "محمود مصطفي عطيه صالح",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التقنيات المتكاملة في تعليم وتعلم STEM"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "أحمد عربى سلامة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أساسيات المنهج المدرسى, المنهج المدرسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "أمانى مصطفى السيد حميدة",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط, تكنولوجيا التعليم والتحول الرقمي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "أميرة عبدالرحمن عبدالباقى إبراهيم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المنهج المدرسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "أميرة محمود محمد السيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط, التقنيات المتكاملة فى التعليم والتعلم, تكنولوجيا التعليم والتحول الرقمي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "اميره فتحي مرسي علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تكنولوجيا التعليم والتحول الرقمي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "جاهندة علي عبد الشافي علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط, تكنولوجيا التعليم والتحول الرقمي, فلسفة التعليم فى مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "حنان حامد سيد اسماعيل",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط, تكنولوجيا التعليم والتحول الرقمي, مهارات يدوية وفنية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "داليا ابراهيم يحيى محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أساسيات المنهج المدرسى"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "رحمة محمود سعد محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "تكنولوجيا التعليم والتحول الرقمي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "سيد محمد سيد خضر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "شيماء إبراهيم أبو المجد هاشم",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المنهج المدرسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "شيماء سعيد سيد مدبولي نصر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط, المنهج المدرسى"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "محمود فوقي أحمد محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "استراتيجيات التعلم النشط"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "هشام عاطف احمد علي",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المنهج المدرسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم": "قسم المناهج وطرق التدريس",
      "اسم الأستاذ": "يسري أحمد على محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "المنهج المدرسي, تكنولوجيا التعليم والتحول الرقمي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "أشرف محرم فريد ابراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فلسفة التعليم فى مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "فكري شحاتة أحمد جبارة",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "فلسفة التعليم فى مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "امل عاطف احمد حسين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "أساسيات البحث التربوى, فلسفة التعليم فى مصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "دينا ابراهيم احمد جمال الدين",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فلسفة التعليم فى مصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "دينا خالد سليمان محمود",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فلسفة التعليم فى مصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "مروة احمد محمد محمود ندا",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فلسفة التعليم فى مصر"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "مروة محمد سمير الموجى",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اساسيات البحث التربوى, النظرية التربوية المعاصرة فى الفلسفة وعلم الاجتماع, فلسفة التعليم فى مصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "مصطفى احمد على احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فلسفة التعليم فى مصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "هبة احمد محمد احمد الشاعر",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "فلسفة التعليم فى مصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم أصول التربية",
      "اسم الأستاذ": "هبه سمير سليمان محمود",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "التربية وقضايا العصر, مهنة التعليم وأدوار المعلم"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "أحمد رفعت علي محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية الدولية, التربية المقارنة, التربية المقارنة والدولية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "أسامة عبدالسلام علي عبدالسلام",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "دعاء محمود عبدالفتاح جوهر",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة والدولية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "صهيب شحته محمد محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, التربية المقارنة والدولية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "عادل محمد حسن سليمان",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة, التربية المقارنة والدولية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "عمر نصير مهران",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة والدولية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "غادة محمد عبدالسلام عبدالحليم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة, التربية المقارنة والدولية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "محمد سعيد عبدالمطلب هلال",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة, التربية المقارنة والدولية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "محمود محمد المهدي سالم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة, التربية المقارنة والدولية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "هالة عبدالمنعم أحمد سليمان",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "التربية المقارنة"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "هناء شحته السيد مندور",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "ولاء عبدالله السيد صقر",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "أميرة سامح عبدالرحمن السيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, التربية الدولية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "رانيا حسن محروس",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, القيادة التربوية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم التربية المقارنة والإدارة التعليمية",
      "اسم الأستاذ": "فريد حسين محمد فريد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "اتجاهات حديثة لضمان الجودة التعليمية, التربية الدولية, التربية المقارنة والدولية"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "محمد سعد حامد عثمان",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "معتز محمد عبيد احمد",
      "الدرجة العلمية": "أستاذ",
      "اسم المقرر": "الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "إيمان لطفى إبراهيم محمد الجيد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "صابر فاروق محمد عباس",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الإرشاد النفسى, الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "عبد العزيز محمود عبد العزيز عبدالفتاح",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "نجوى إبراهيم عبدالمنعم محمد",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الارشاد والتفكر فى الممارسة المهنية, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "نورا محمد عرفة محمود",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "هبة سامي محمود إبراهيم",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "الإرشاد النفسي, الاوبئة والصحة العقلية, التغيرات المناخية, جغرافيا مصر, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "هدى حسن رأفت الخواص",
      "الدرجة العلمية": "أستاذ مساعد",
      "اسم المقرر": "علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "أسامه سامي صدقي محارب",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "أمل فواز فتحي عزيز",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "أميرة محمد إمام محمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الإرشاد النفسى, الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "اسلام رمضان ابراهيم احمد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الإرشاد النفسي"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "سارة طه عبد السلام السيد",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الإرشاد النفسي, علم نفس النمو"
    },
    {
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم": "قسم الصحة النفسية والإرشاد النفسي",
      "اسم الأستاذ": "فاطمة عصام يحيى زكريا",
      "الدرجة العلمية": "مدرس",
      "اسم المقرر": "الإرشاد النفسي, علم نفس النمو"
    }
  ],
  "department_stats": [],
  "hourly_density": [
    {
      "م": "1",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم العلوم البيولوجية والجيولوجية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "16"
    },
    {
      "م": "2",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم العلوم البيولوجية والجيولوجية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "16"
    },
    {
      "م": "3",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم العلوم البيولوجية والجيولوجية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "16"
    },
    {
      "م": "4",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-23",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم العلوم البيولوجية والجيولوجية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "14"
    },
    {
      "م": "5",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم اللغة الإنجليزية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "6"
    },
    {
      "م": "6",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم اللغة الإنجليزية",
      "عدد الاختبارات بالساعة": "22",
      "عدد أعضاء هيئة التدريس": "6"
    },
    {
      "م": "7",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم اللغة الإنجليزية",
      "عدد الاختبارات بالساعة": "22",
      "عدد أعضاء هيئة التدريس": "6"
    },
    {
      "م": "8",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-24",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم اللغة الإنجليزية",
      "عدد الاختبارات بالساعة": "22",
      "عدد أعضاء هيئة التدريس": "3"
    },
    {
      "م": "9",
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم اللغة العربية والدراسات الإسلامية",
      "عدد الاختبارات بالساعة": "24",
      "عدد أعضاء هيئة التدريس": "13"
    },
    {
      "م": "10",
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم اللغة العربية والدراسات الإسلامية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "13"
    },
    {
      "م": "11",
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم اللغة العربية والدراسات الإسلامية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "11"
    },
    {
      "م": "12",
      "اليوم": "الثلاثاء",
      "التاريخ": "2026-08-25",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم التربية الخاصة",
      "عدد الاختبارات بالساعة": "30",
      "عدد أعضاء هيئة التدريس": "12"
    },
    {
      "م": "13",
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم الفيزياء",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "15"
    },
    {
      "م": "14",
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم الفيزياء",
      "عدد الاختبارات بالساعة": "20",
      "عدد أعضاء هيئة التدريس": "15"
    },
    {
      "م": "15",
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم الفيزياء",
      "عدد الاختبارات بالساعة": "20",
      "عدد أعضاء هيئة التدريس": "13"
    },
    {
      "م": "16",
      "اليوم": "الأربعاء",
      "التاريخ": "2026-08-26",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم اللغة الألمانية",
      "عدد الاختبارات بالساعة": "28",
      "عدد أعضاء هيئة التدريس": "17"
    },
    {
      "م": "17",
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم الكيمياء",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "16"
    },
    {
      "م": "18",
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم الكيمياء",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "16"
    },
    {
      "م": "19",
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم الكيمياء",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "16"
    },
    {
      "م": "20",
      "اليوم": "السبت",
      "التاريخ": "2026-08-22",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم الفلسفة وعلم الاجتماع",
      "عدد الاختبارات بالساعة": "31",
      "عدد أعضاء هيئة التدريس": "15"
    },
    {
      "م": "21",
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم علم النفس التربوي",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "12"
    },
    {
      "م": "22",
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم علم النفس التربوي",
      "عدد الاختبارات بالساعة": "20",
      "عدد أعضاء هيئة التدريس": "11"
    },
    {
      "م": "23",
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم التاريخ",
      "عدد الاختبارات بالساعة": "19",
      "عدد أعضاء هيئة التدريس": "14"
    },
    {
      "م": "24",
      "اليوم": "السبت",
      "التاريخ": "2026-08-29",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم التاريخ",
      "عدد الاختبارات بالساعة": "18",
      "عدد أعضاء هيئة التدريس": "14"
    },
    {
      "م": "25",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم الرياضيات",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "15"
    },
    {
      "م": "26",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم الرياضيات",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "15"
    },
    {
      "م": "27",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم الرياضيات",
      "عدد الاختبارات بالساعة": "21",
      "عدد أعضاء هيئة التدريس": "15"
    },
    {
      "م": "28",
      "اليوم": "الأحد",
      "التاريخ": "2026-08-30",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم اللغة الفرنسية",
      "عدد الاختبارات بالساعة": "31",
      "عدد أعضاء هيئة التدريس": "21"
    },
    {
      "م": "29",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "2 م - 3 م",
      "القسم / الأقسام المجدولة": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "عدد الاختبارات بالساعة": "23",
      "عدد أعضاء هيئة التدريس": "12"
    },
    {
      "م": "30",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "3 م - 4 م",
      "القسم / الأقسام المجدولة": "قسم الجغرافيا ونظم المعلومات الجغرافية",
      "عدد الاختبارات بالساعة": "22",
      "عدد أعضاء هيئة التدريس": "12"
    },
    {
      "م": "31",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "4 م - 5 م",
      "القسم / الأقسام المجدولة": "قسم المناهج وطرق التدريس",
      "عدد الاختبارات بالساعة": "13",
      "عدد أعضاء هيئة التدريس": "24"
    },
    {
      "م": "32",
      "اليوم": "الاثنين",
      "التاريخ": "2026-08-31",
      "الفترة الزمنية": "5 م - 6 م",
      "القسم / الأقسام المجدولة": "قسم الصحة النفسية والإرشاد النفسي + قسم أصول التربية + قسم التربية المقارنة والإدارة التعليمية",
      "عدد الاختبارات بالساعة": "16",
      "عدد أعضاء هيئة التدريس": "40"
    }
  ]
};
